In [2]:
%load_ext sql

In [30]:
%sql create table country(id integer primary key not NULL,name varchar(20))
%sql sqlite:///data2.db

   sqlite:///data.db
 * sqlite:///data2.db
(sqlite3.OperationalError) table country already exists
[SQL: create table country(id integer primary key not NULL,name varchar(20))]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

DatabaseError: Execution failed on sql 'data2.db': near "data2": syntax error

In [54]:
for i in range(5):
    st='iran'+str(i)
    %sql insert into country(name) VALUES(:st);

   sqlite:///data.db
 * sqlite:///data2.db
1 rows affected.
   sqlite:///data.db
 * sqlite:///data2.db
1 rows affected.
   sqlite:///data.db
 * sqlite:///data2.db
1 rows affected.
   sqlite:///data.db
 * sqlite:///data2.db
1 rows affected.
   sqlite:///data.db
 * sqlite:///data2.db
1 rows affected.

In [55]:
%sql select * from country

   sqlite:///data.db
 * sqlite:///data2.db
Done.

[(1, 'iran'),
 (2, 'iran'),
 (3, 'iran'),
 (4, 'iran'),
 (5, 'iran'),
 (6, 'iran'),
 (7, 'iran'),
 (8, 'iran'),
 (9, 'iran'),
 (10, 'iran'),
 (11, '0'),
 (12, '1'),
 (13, '2'),
 (14, '3'),
 (15, '4'),
 (16, 'iran0'),
 (17, 'iran1'),
 (18, 'iran2'),
 (19, 'iran3'),
 (20, 'iran4')]

In [45]:
import sqlite3,csv
import pandas as pd
con=sqlite3.connect('data2.db')
cursor=con.cursor()
df = pd.read_sql('select * from country',con)

con.close()
df

   id  name
0   1  iran
1   2  iran
2   3  iran
3   4  iran
4   5  iran
5   6  iran
6   7  iran
7   8  iran
8   9  iran
9  10  iran